configuration/src/Catalogs/ExternalUsers/ExternalUsers.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ExternalUsers</name>
  <comment>APK:413 - # 744.2.1.1 it is Acceptable not to disable the selection history, since it is used, and the selection redefinition is fixed, that is, service and invalid users will not get into it, but if they somehow got into it, this is not a problem</comment>
  <attributes>
    <name>Invalid</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>AuthorizationObject</name>
    <type>
      <types>DefinedType.ExternalUser</types>
    </type>
  </attributes>
  <attributes>
    <name>SetRolesDirectly</name>
    <comment>Used if the &quot;access Control&quot; subsystem is not built in&quot;</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Comment</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Prepared</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>IBUserID</name>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
  <attributes>
    <name>ServiceUserID</name>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
  <attributes>
    <name>DeleteInfobaseUserProperties</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <tabularSections>
    <name>AdditionalAttributes</name>
    <attributes>
      <name>Property</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.AdditionalAttributesAndInfo</types>
      </type>
    </attributes>
    <attributes>
      <name>Value</name>
      <type>
        <types>Characteristic.AdditionalAttributesAndInfo</types>
      </type>
    </attributes>
    <attributes>
      <name>TextString</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

configuration/src/InformationRegisters/UsersInfo/UsersInfo.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>UsersInfo</name>
  <resources>
    <name>UserMustChangePasswordOnAuthorization</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>UnlimitedValidityPeriod</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ValidityPeriod</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>InactivityPeriodBeforeDenyingAuthorization</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>AuthorizationAllowedDate</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>LastActivityDate</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>AutomaticAuthorizationProhibitionDate</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>DeletePasswordUsageStartDate</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>DeletePreviousPasswords</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </resources>
  <attributes>
    <name>LastUsedClient</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>NumberOfStatePicture</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>CanSignIn</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>IsAppLogonRestricted</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>HasNoRights</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>HasInsufficientRightForLogon</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Name</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Email</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>StandardAuthentication</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>CannotChangePassword</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>CannotRecoveryPassword</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ShowInList</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>OpenIDAuthentication</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>OpenIDConnectAuthentication</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>AccessTokenAuthentication</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>OSAuthentication</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>OSUser</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Language</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>UnsafeActionProtection</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <dimensions>
    <name>User</name>
    <type>
      <types>CatalogRef.ExternalUsers</types>
      <types>CatalogRef.Users</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

configuration/src/Catalogs/ExternalUsersGroups/ExternalUsersGroups.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ExternalUsersGroups</name>
  <hierarchical>true</hierarchical>
  <hierarchyType>HierarchyOfItems</hierarchyType>
  <predefined>
    <items>
      <name>AllExternalUsers</name>
      <description>All external users</description>
    </items>
  </predefined>
  <attributes>
    <name>Comment</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>AllAuthorizationObjects</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Content</name>
    <attributes>
      <name>ExternalUser</name>
      <type>
        <types>CatalogRef.ExternalUsers</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Roles</name>
    <attributes>
      <name>Role</name>
      <type>
        <types>CatalogRef.MetadataObjectIDs</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Purpose</name>
    <attributes>
      <name>UsersType</name>
      <type>
        <types>DefinedType.ExternalUser</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

configuration/src/Catalogs/ExternalUsers/ObjectModule.bsl
///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2023, OOO 1C-Soft
// All rights reserved. This software and the related materials 
// are licensed under a Creative Commons Attribution 4.0 International license (CC BY 4.0).
// To view the license terms, follow the link:
// https://creativecommons.org/licenses/by/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////
//

#If Server Or ThickClientOrdinaryApplication Or ExternalConnection Then

#Region Variables

Var IBUserProcessingParameters; // 
                                        // 

Var IsNew; // 
                // 

Var PreviousAuthorizationObject; // 
                               // 

#EndRegion

// 
//
// 
//
// 
//
// 

#Region EventsHandlers

Procedure BeforeWrite(Cancel)
	
	If DataExchange.Load Then
		Return;
	EndIf;
	
	IsNew = IsNew();
	
	If Not ValueIsFilled(AuthorizationObject) Then
		Raise NStr("en = 'No authorization object is set for the external user.';");
	Else
		ErrorText = "";
		If UsersInternal.AuthorizationObjectIsInUse(
		         AuthorizationObject, Ref, , , ErrorText) Then
			
			Raise ErrorText;
		EndIf;
	EndIf;
	
	// Checking whether the authorization object was not changed.
	If IsNew Then
		PreviousAuthorizationObject = NULL;
	Else
		PreviousAuthorizationObject = Common.ObjectAttributeValue(
			Ref, "AuthorizationObject");
		
		If ValueIsFilled(PreviousAuthorizationObject)
		   And PreviousAuthorizationObject <> AuthorizationObject Then
			
			Raise NStr("en = 'Cannot change a previously specified authorization object.';");
		EndIf;
	EndIf;
	
	UsersInternal.StartIBUserProcessing(ThisObject, IBUserProcessingParameters);
	
	SetPrivilegedMode(True);
	InformationRegisters.UsersInfo.UpdateUserInfoRecords(
		UsersInternal.ObjectRef2(ThisObject), ThisObject);
	SetPrivilegedMode(False);
	
EndProcedure

Procedure OnWrite(Cancel)
	
	If DataExchange.Load Then
		Return;
	EndIf;
	
	// Updating the content of the group that contains the new external user (provided that it is in a group).
	If AdditionalProperties.Property("NewExternalUserGroup")
	   And ValueIsFilled(AdditionalProperties.NewExternalUserGroup) Then
		
		Block = New DataLock;
		Block.Add("Catalog.ExternalUsersGroups");
		Block.Lock();
		
		GroupObject1 = AdditionalProperties.NewExternalUserGroup.GetObject(); // CatalogRef.ExternalUsersGroups
		GroupObject1.Content.Add().ExternalUser = Ref;
		GroupObject1.Write();
	EndIf;
	
	// Updating the content of the "All external users" automatic group.
	ItemsToChange = New Map;
	ModifiedGroups   = New Map;
	
	UsersInternal.UpdateExternalUserGroupCompositions(
		Catalogs.ExternalUsersGroups.AllExternalUsers,
		Ref,
		ItemsToChange,
		ModifiedGroups);
	
	UsersInternal.UpdateUserGroupCompositionUsage(
		Ref, ItemsToChange, ModifiedGroups);
	
	UsersInternal.EndIBUserProcessing(
		ThisObject, IBUserProcessingParameters);
	
	UsersInternal.AfterUpdateExternalUserGroupCompositions(
		ItemsToChange,
		ModifiedGroups);
	
	If PreviousAuthorizationObject <> AuthorizationObject Then
		SSLSubsystemsIntegration.AfterChangeExternalUserAuthorizationObject(
			Ref, PreviousAuthorizationObject, AuthorizationObject);
	EndIf;
	
	SSLSubsystemsIntegration.AfterAddChangeUserOrGroup(Ref, IsNew);
	
EndProcedure

Procedure BeforeDelete(Cancel)
	
	If DataExchange.Load Then
		Return;
	EndIf;
	
	CommonActionsBeforeDeleteInNormalModeAndDuringDataExchange();
	
EndProcedure

Procedure OnCopy(CopiedObject)
	
	AdditionalProperties.Insert("CopyingValue", CopiedObject.Ref);
	
	IBUserID = Undefined;
	ServiceUserID = Undefined;
	Prepared = False;
	
	Comment = "";
	
EndProcedure

#EndRegion

#Region Private

// For internal use only.
Procedure CommonActionsBeforeDeleteInNormalModeAndDuringDataExchange() Export
	
	// 
	// 
	
	IBUserDetails = New Structure;
	IBUserDetails.Insert("Action", "Delete");
	AdditionalProperties.Insert("IBUserDetails", IBUserDetails);
	
	UsersInternal.StartIBUserProcessing(ThisObject, IBUserProcessingParameters, True);
	UsersInternal.EndIBUserProcessing(ThisObject, IBUserProcessingParameters);
	
EndProcedure

#EndRegion

#Else
Raise NStr("en = 'Invalid object call on the client.';");
#EndIf
